<a href="https://colab.research.google.com/github/profliuhao/CSIT355/blob/main/CSIT_355_Module_6_Null_Outer_Join_Constraints.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

CSIT 355 In Class Exercise: NULL, Outer Join & More Constraints
=============================================

In [1]:
#Let's connect to a database **lab4.db** using:
%load_ext sql
#%reload_ext sql
%sql sqlite:///lab4.db

In [10]:
%config SqlMagic.style='_DEPRECATED_DEFAULT'

In [11]:
%%sql

DROP TABLE IF EXISTS Sailors;
-- Create the Sailors table
CREATE TABLE Sailors (
    sid INTEGER PRIMARY KEY,
    name VARCHAR(50),
    rating INTEGER,
    age INTEGER
);

-- Insert sample data with NULL values
INSERT INTO Sailors (sid, name, rating, age) VALUES
    (1, 'John', 8, 25),
    (2, NULL, 9, 30),
    (3, 'Mike', NULL, 35),
    (4, 'Sarah', 7, NULL),
    (5, NULL, NULL, 28),
    (6, 'Tom', 8, 42),
    (7, 'Tom', NULL, 42),    -- Duplicate name with NULL rating
    (8, NULL, 8, 42),        -- NULL name with same age as others
    (9, 'Tom', 8, 42),  -- Complete duplicate of sid 6
    (10, NULL, 8, 42);    -- Duplicate with null values in name

 * sqlite:///lab4.db
Done.
Done.
10 rows affected.

[]

In [12]:
%%sql
-- Demo 1: COUNT(*) vs COUNT(column)
SELECT 'COUNT(*) Demo' as demo,
    COUNT(*) as total_count,
    COUNT(name) as name_count,
    COUNT(rating) as rating_count,
    COUNT(age) as age_count
FROM Sailors;

 * sqlite:///lab4.db
Done.

[('COUNT(*) Demo', 10, 6, 7, 9)]

In [13]:
%%sql

-- Demo 2: Aggregates with NULL values
SELECT 'Aggregate Demo' as demo,
    AVG(rating) as avg_rating,
    MAX(rating) as max_rating,
    MIN(rating) as min_rating
FROM Sailors;

 * sqlite:///lab4.db
Done.

[('Aggregate Demo', 8.0, 9, 7)]

In [14]:
%%sql
SELECT COUNT(*) as total_count
FROM Sailors;

 * sqlite:///lab4.db
Done.

[(10,)]

In [15]:
%%sql
SELECT COUNT(rating) as rating_count
FROM Sailors;

 * sqlite:///lab4.db
Done.

[(7,)]

In [16]:
%%sql

-- Demo 3: Non-equivalent queries with NULLs
SELECT 'Query Comparison Demo' as demo;

SELECT COUNT(*) as total_count
FROM Sailors;

SELECT COUNT(rating) as rating_count
FROM Sailors;

SELECT COUNT(*) as all_ratings
FROM Sailors
WHERE (rating > 8) OR (rating <= 8);

 * sqlite:///lab4.db
Done.
Done.
Done.
Done.

[(7,)]

In [17]:
%%sql

-- Demo 4: DISTINCT with NULL values
SELECT 'DISTINCT Demo' as demo;

SELECT DISTINCT name, rating, age
FROM Sailors
ORDER BY name NULLS FIRST;

 * sqlite:///lab4.db
Done.
Done.

[(None, 9, 30),
 (None, None, 28),
 (None, 8, 42),
 ('John', 8, 25),
 ('Mike', None, 35),
 ('Sarah', 7, None),
 ('Tom', 8, 42),
 ('Tom', None, 42)]

In [18]:
%%sql

-- Demo 5: GROUP BY with NULL values
SELECT 'GROUP BY Demo' as demo,
    name,
    COUNT(*) as count,
    AVG(rating) as avg_rating
FROM Sailors
GROUP BY name;

 * sqlite:///lab4.db
Done.

[('GROUP BY Demo', None, 4, 8.333333333333334),
 ('GROUP BY Demo', 'John', 1, 8.0),
 ('GROUP BY Demo', 'Mike', 1, None),
 ('GROUP BY Demo', 'Sarah', 1, 7.0),
 ('GROUP BY Demo', 'Tom', 3, 8.0)]

In [19]:
%%sql

-- Demo 6: Set operations with NULL values
SELECT 'UNION Demo' as demo;

-- Create temporary table for set operation demo
CREATE TEMPORARY TABLE SailorsCopy AS
SELECT * FROM Sailors WHERE sid IN (1, 2, 5, 6, 7);

-- Demonstrate UNION behavior with NULL values
SELECT name, rating, age FROM Sailors
UNION
SELECT name, rating, age FROM SailorsCopy
ORDER BY name NULLS FIRST;

 * sqlite:///lab4.db
Done.
Done.
Done.

[(None, None, 28),
 (None, 8, 42),
 (None, 9, 30),
 ('John', 8, 25),
 ('Mike', None, 35),
 ('Sarah', 7, None),
 ('Tom', None, 42),
 ('Tom', 8, 42)]


## Exercise: Outer Join
We are going to work on the following three tables:
1. Game(<u>Team</u>:string, wins:integer, losses:integer)

2. Arena(<u>Arena</u>:string, <u>city</u>:string, team:string)

In [20]:
%%sql
drop table if exists game;
drop table if exists arena;
CREATE TABLE game(
       team        varchar primary key,
       wins     integer,
       losses   integer
);

CREATE TABLE arena(
       arena        varchar primary key,
       city        varchar,
       team        varchar,
       Foreign key (team) references game
);

 * sqlite:///lab4.db
Done.
Done.
Done.
Done.

[]

In [21]:
%%sql
insert into game values('Boston Celtics', 53, 29);
insert into game values('New York Knicks', 31, 51);
insert into game values('Brooklyn Nets', 20, 62);
insert into game values('Huston Rockets', 65, 17);
insert into arena values('Barclays Center', 'New York', 'Brooklyn Nets');
insert into arena values('Madison Square Garden', 'New York', 'New York Knicks');
insert into arena values('TD Garden', 'Boston', 'Boston Celtics');
insert into arena values('United Center', 'Chicago', 'Chicago Bulls');

 * sqlite:///lab4.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [22]:
%sql select * from game;

 * sqlite:///lab4.db
Done.

[('Boston Celtics', 53, 29),
 ('New York Knicks', 31, 51),
 ('Brooklyn Nets', 20, 62),
 ('Huston Rockets', 65, 17)]

In [23]:
%sql select * from arena

 * sqlite:///lab4.db
Done.

[('Barclays Center', 'New York', 'Brooklyn Nets'),
 ('Madison Square Garden', 'New York', 'New York Knicks'),
 ('TD Garden', 'Boston', 'Boston Celtics'),
 ('United Center', 'Chicago', 'Chicago Bulls')]

### Exercise 1
List the names in team and their arena, preserve the teams in **Game** even if they have no arenas in **Arena**.

In [ ]:
%%sql
-- your answer here

### Exercise 2
List the names in team and their arena, preserve all the arenas in **Arena** even if there is no infomation of their teams in **Game**.

In [ ]:
%%sql
-- use right join

In [ ]:
%%sql
-- use left join

## Exercise： More Constraints


Given the following three schemas:

sailors(<u>sid</u>:integer, sname:string, rating:integer, age:real)

reserves(<u>sid</u>:integer, <u>bid</u>:integer, day:date)

boats(<u>bid</u>:integer, bname:string, color:string)

### Exercise 3.1
Creating the table **Sailors** and constrain the rating range between 1 and 10, and the age range between 0 and 100.

In [ ]:
%%sql
-- Create the "Sailors" table
drop table if exists Sailors;
-- fill in here

In [ ]:
%%sql
-- Create the "Reserves" table
drop table if exists Reserves;

-- fill in here



-- Create the "Boats" table
drop table if exists Boats;

-- fill in here

Execute the following commands to insert tuples in **sailors**.

In [34]:
%%sql
-- Insert rows into the "Sailors" table
delete from Sailors;
INSERT INTO Sailors (sid, sname, rating, age) VALUES
    (22, 'Dustin', 7, 45),
    (29, 'Brutus', 1, 33),
    (31, 'Lubber', 8, 55.5),
    (32, 'Andy', 8, 25.5),
    (58, 'Rusty', 10, 35),
    (64, 'Horatio', 7, 35),
    (71, 'Zorba', 10, 16),
    (74, 'Horatio', 9, 35),
    (85, 'Art', 3, 25.5),
    (95, 'Bob', 3, 63.5);

-- Insert rows into the "Boats" table
delete from Boats;
INSERT INTO Boats (bid, name, color) VALUES
    (101, 'Interlake', 'blue'),
    (102, 'Interlake', 'red'),
    (103, 'Clipper', 'green'),
    (104, 'Marine', 'red');

-- Insert rows into the "Reserves" table
delete from Reserves;
INSERT INTO Reserves (sid, bid, day) VALUES
    (22, 101, '10/10/98'),
    (22, 102, '10/11/98'),
    (22, 103, '10/8/98'),
    (22, 104, '10/7/98'),
    (31, 102, '11/10/98'),
    (31, 103, '10/6/98'),
    (31, 104, '11/12/98'),
    (64, 101, '9/5/98'),
    (64, 102, '9/8/98'),
    (74, 103, '9/8/98');

 * sqlite:///lab4.db
0 rows affected.
10 rows affected.
0 rows affected.
4 rows affected.
0 rows affected.
10 rows affected.

[]

### Exercise 3.2
What will happend if you execute the following statement?

In [ ]:
%sql insert into sailors values(111, 'James', 2, 163.5);

### Foreign key, update and delete cascade

In [ ]:
%%sql
DROP TABLE IF EXISTS Students;

CREATE TABLE Students (
  sid CHAR(20) PRIMARY KEY,
  name CHAR(20),
  login CHAR(10),
  age INT,
  gpa FLOAT
);

-- insert students values
INSERT INTO Students (sid, name, login, age, gpa)
VALUES
('S000', 'Unknown', 'unknown', 0, 0),
  ('S001', 'John Doe', 'johnd', 22, 3.5),
  ('S002', 'Jane Smith', 'janes', 20, 3.9),
  ('S003', 'Bob Johnson', 'bobj', 21, 3.2),
  ('S004', 'Alice Brown', 'aliceb', 23, 3.7),
  ('S005', 'Eva Wilson', 'evaw', 19, 3.8);

In [ ]:
%%sql
-- Create the Enrolled table
-- on delete sid, set default to S000
-- on update sid, cascade
DROP TABLE IF EXISTS Enrolled;

-- fill in here

In [ ]:
%%sql
PRAGMA foreign_keys = ON;
-- PRAGMA foreign_keys = OFF;
-- PRAGMA table_info([Enrolled]);

In [ ]:
%%sql
select * from Students;

In [ ]:
%%sql
insert into Enrolled values ('S002', 'C123', 'A+');

In [ ]:
%%sql
-- Insert a record into Enrolled with an invalid sid value
INSERT INTO Enrolled (sid, cid, grade)
VALUES ('S006', 'C004', 'B');

In [ ]:
%%sql
-- check the enrolled table before update student id
select * from Enrolled;

In [ ]:
%%sql
-- update sid 'S002' with 'S022' from the students table
-- fill in here

In [ ]:
%%sql
-- check  the enrolled table  after update student id in students table
select * from Enrolled;

In [ ]:
%%sql
-- delete sid = 'S022' from the students table
-- fill in here

 * sqlite:///lab4.db
1 rows affected.

[]

In [ ]:
%%sql
-- check the enrolled table after delete student id in students table
select * from Enrolled;

### Delete on cascade

In [ ]:
%%sql
PRAGMA foreign_keys = OFF;

In [ ]:
%%sql
-- Create the Enrolled table
-- on delete sid, cascade
-- on update sid, cascade
DROP TABLE IF EXISTS Enrolled;

-- fill in here

In [ ]:
%%sql
PRAGMA foreign_keys = ON;

In [ ]:
%%sql
select * from Students;

In [ ]:
%%sql
insert into Enrolled values ('S004', 'C123', 'A+');

In [ ]:
%%sql
-- delete sid S004 from the students table
-- fill in here

In [ ]:
%%sql
-- check the enrolled table after delete student id in students table
select * from Enrolled;